#!/bin/bash

echo "-----------check list-----------"

​./U-01.sh

​./U-02.sh

​./U-03.sh

​./U-04.sh

​./U-05.sh

​./U-06.sh

​./U-07.sh

​./U-08.sh

​./U-09.sh

​./U-10.sh

​./U-11.sh

​./U-12.sh

​./U-13.sh

​./U-14.sh

​./U-15.sh

​./U-16.sh

​./U-17.sh

​./U-18.sh

​./U-19.sh

​./U-20.sh

​./U-21.sh

​./U-22.sh

​./U-24.sh

​./U-28.sh

​./U-30.sh

​./U-32.sh

​./U-34.sh

​./U-35.sh

​./U-36.sh

​./U-37.sh

​./U-38.sh

​./U-39.sh

​./U-40.sh

​./U-41.sh

​./U-42.sh

​./U-43.sh

​./U-44.sh

​./U-45.sh

​./U-46.sh

​./U-47.sh

​./U-48.sh

​./U-49.sh

​./U-50.sh

​./U-51.sh

​./U-52.sh

​./U-53.sh

​./U-54.sh

​./U-55.sh

​./U-56.sh

​./U-57.sh

​./U-58.sh

​./U-59.sh

​./U-60.sh

​./U-61.sh

​./U-62.sh

​./U-63.sh

​./U-64.sh

​./U-65.sh

​./U-66.sh

​./U-67.sh

​./U-68.sh

​./U-69.sh

​./U-70.sh

​./U-71.sh

​./U-72.sh

​./U-72.sh