#!/bin/bash

echo "-----------check list-----------"

sh​ ./U-01.​sh

​​sh ./U-02.​sh

​​​sh ./U-03.​​sh

​​​sh ./U-04.​​sh

​​​sh ./U-05.​​sh

​​​sh ./U-06.​​sh

​​​sh ./U-07.​​sh

​​​sh ./U-08.​​sh

​​​sh ./U-09.​​sh

​​​sh ./U-10.​​sh

​​​sh ./U-11.​​sh

​​​sh ./U-12.​​sh

​​​sh ./U-13.​​sh

​​​sh ./U-14.​​sh

​​​sh ./U-15.​​sh

​​​sh ./U-16.​​sh

​​​sh ./U-17.​​sh

​​​sh ./U-18.​​sh

​​​sh ./U-19.​​sh

​​​sh ./U-20.​​sh

​​​sh ./U-21.​​sh

​​​sh ./U-22.​​sh

​​​sh ./U-24.​​sh

​​​sh ./U-28.​​sh

​​​sh ./U-30.​​sh

​​​sh ./U-32.​​sh

​​​sh ./U-34.​​sh

​​​sh ./U-35.​​sh

​​​sh ./U-36.​​sh

​​​sh ./U-37.​​sh

​​​sh ./U-38.​​sh

​​​sh ./U-39.​​sh

​​​sh ./U-40.​​sh

​​​sh ./U-41.​​sh

​​​sh ./U-42.​​sh

​​​sh ./U-43.​​sh

​​​sh ./U-44.​​sh

​​​sh ./U-45.​​sh

​​​sh ./U-46.​​sh

​​​sh ./U-47.​​sh

​​​sh ./U-48.​​sh

​​​sh ./U-49.​​sh

​​​sh ./U-50.​​sh

​​​sh ./U-51.​​sh

​​​sh ./U-52.​​sh

​​​sh ./U-53.​​sh

​​​sh ./U-54.​​sh

​​​sh ./U-55.​​sh

​​sh ./U-56.​​sh

​​sh ./U-57.​​sh

​​sh ./U-58.​​sh

​​sh ./U-59.​​sh

​​sh ./U-60.​​sh

​​sh ./U-61.​​sh

​​sh ./U-62.​​sh

​​sh ./U-63.​​sh

​​sh ./U-64.​​sh

​​sh ./U-65.​​sh

​​sh ./U-66.​​sh

​​sh ./U-67.​​sh

​​sh ./U-68.​​sh

​​sh ./U-69.​​sh

​​sh ./U-70.​​sh

​​sh ./U-71.​​sh

​​sh ./U-72.​​sh

​​sh ./U-72.​​sh